Basic aggregate numbers covering 1979-2016, by country, year, age groups and sex.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('who_suicide_statistics.csv')

In [3]:
df

        country  year     sex          age  suicides_no  population
0       Albania  1985  female  15-24 years          NaN    277900.0
1       Albania  1985  female  25-34 years          NaN    246800.0
2       Albania  1985  female  35-54 years          NaN    267500.0
3       Albania  1985  female   5-14 years          NaN    298300.0
4       Albania  1985  female  55-74 years          NaN    138700.0
...         ...   ...     ...          ...          ...         ...
43771  Zimbabwe  1990    male  25-34 years        150.0         NaN
43772  Zimbabwe  1990    male  35-54 years        132.0         NaN
43773  Zimbabwe  1990    male   5-14 years          6.0         NaN
43774  Zimbabwe  1990    male  55-74 years         74.0         NaN
43775  Zimbabwe  1990    male    75+ years         13.0         NaN

[43776 rows x 6 columns]

In [4]:
df.shape

(43776, 6)

In [5]:
df['year'].unique()

array([1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995,
       1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006,
       2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 1983, 1984,
       2016, 1979, 1980, 1981, 1982], dtype=int64)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43776 entries, 0 to 43775
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      43776 non-null  object
 1   year         43776 non-null  int64
 2   sex          43776 non-null  object
 3   age          43776 non-null  object
 4   suicides_no  41520 non-null  float64
 5   population   38316 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.0+ MB

In [7]:
 df['age'].unique()

array(['15-24 years', '25-34 years', '35-54 years', '5-14 years',
       '55-74 years', '75+ years'], dtype=object)

In [8]:
df['suicides_no'].isnull().sum()

2256

In [9]:
df['population'].isnull().sum()

5460

In [11]:
df[df['population'].isnull()]

        country  year     sex          age  suicides_no  population
372    Anguilla  1983  female  15-24 years          0.0         NaN
373    Anguilla  1983  female  25-34 years          0.0         NaN
374    Anguilla  1983  female  35-54 years          0.0         NaN
375    Anguilla  1983  female   5-14 years          0.0         NaN
376    Anguilla  1983  female  55-74 years          0.0         NaN
...         ...   ...     ...          ...          ...         ...
43771  Zimbabwe  1990    male  25-34 years        150.0         NaN
43772  Zimbabwe  1990    male  35-54 years        132.0         NaN
43773  Zimbabwe  1990    male   5-14 years          6.0         NaN
43774  Zimbabwe  1990    male  55-74 years         74.0         NaN
43775  Zimbabwe  1990    male    75+ years         13.0         NaN

[5460 rows x 6 columns]

In [12]:
df[df['population'].isnull()]['country'].unique()

array(['Anguilla', 'Bermuda', 'Bolivia', 'British Virgin Islands',
       'Cayman Islands', 'Dominica', 'Dominican Republic',
       'Falkland Islands (Malvinas)', 'Haiti', 'Honduras', 'Iraq',
       'Jordan', 'Malaysia', 'Monaco', 'Montserrat', 'Morocco',
       'Netherlands Antilles', 'Nicaragua',
       'Occupied Palestinian Territory', 'Peru', 'Rodrigues',
       'Saint Kitts and Nevis', 'Saint Pierre and Miquelon', 'San Marino',
       'Saudi Arabia', 'Syrian Arab Republic', 'Tajikistan', 'Tunisia',
       'Turks and Caicos Islands', 'Zimbabwe'], dtype=object)